recept/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>InformationRegister.СведенияВПродукцииИзСчетов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусОбеспеченияЗаказа</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыРезервы</registerRecords>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгрузка</name>
    <type>
      <types>EnumRef.СтатусыЗаказаКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбеспеченияЗаказа</name>
    <type>
      <types>EnumRef.СтытусОбеспеченияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПокупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Потребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатуры</name>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>CatalogRef.Цвет</types>
      </type>
    </attributes>
    <attributes>
      <name>RAL</name>
      <type>
        <types>CatalogRef.RAL</types>
      </type>
    </attributes>
    <attributes>
      <name>Фасовка</name>
      <type>
        <types>CatalogRef.Фасовка</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходнойКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/AccumulationRegisters/ЗаказыРезервы/ЗаказыРезервы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыРезервы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.Цвет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RAL</name>
    <type>
      <types>CatalogRef.RAL</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фасовка</name>
    <type>
      <types>CatalogRef.Фасовка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Enums/СтатусыЗаказаКлиента/СтатусыЗаказаКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказаКлиента</name>
  <enumValues>
    <name>НеГотов</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноГотов</name>
  </enumValues>
  <enumValues>
    <name>Готов</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Перегруз</name>
  </enumValues>
</mdclass:Enum>

recept/src/Enums/СтатусыГотовностиПродукции/СтатусыГотовностиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыГотовностиПродукции</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/ДокументПродажи/ДокументПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументПродажи</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.Продано</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьПродажи</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьМатериалов</registerRecords>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастКлиента</name>
    <type>
      <types>EnumRef.ВозрастКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Производство</name>
  <registerRecords>AccumulationRegister.СтадииВыполненияЗаказов</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РольКомпонента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СборкаКомплектов</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Документ.ДокументПродажи.Проведен" Тогда
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		КоличествоБольшеОстатка = 0;        
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
			//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
			 //Получает остаток из регистра
			СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
			Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
				КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
		КонецЦикла;      
		
		Колво = Объект.Товары.Итог("Количество");
		Продано = Объект.Товары.Итог("Продано");
		Остаток = Объект.Товары.Итог("Остаток");  
		//Автостатус "Счета в работе"
		Если Колво > 0 Тогда
			Если Колво > Продано Тогда 
				Если Остаток = 0 Тогда 
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
				ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
				ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
				КонецЕсли;
			ИначеЕсли  Колво = Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
			ИначеЕсли  Колво < Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;  
	
	Если ИмяСобытия = "Документ.Производство.Проведен" ИЛИ ИмяСобытия = "Документ.ВыпускПродукции.Проведен" Тогда 
		КоличествоБольшеОстатка = 0;
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл 
			СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура); 
			//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);	
			 //Получает остаток из ркгистра
			СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
			Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
				КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
			КонецЕсли; 
	
		КонецЦикла;    
		
		Колво = Объект.Товары.Итог("Количество");
		Продано = Объект.Товары.Итог("Продано");
		Остаток = Объект.Товары.Итог("Остаток");  
		КоличествоБольшеОстатка = 0;        
		//Автостатус "Счета в работе"
		Если Колво > 0 Тогда
			Если Колво > Продано Тогда 
				Если Остаток = 0 Тогда 
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
				ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
				ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
					Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
				КонецЕсли;
			ИначеЕсли  Колво = Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
			ИначеЕсли  Колво < Продано Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоличествоБольшеОстатка = 0;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные; 
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
		СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
		СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
		//Проверка частичной готовности для Автостатус "Счета в работе"
		Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
			КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
		КонецЕсли;   
		//Проверка соответствия статуса Товара	
		Если СтрокаТабличнойЧасти.Остаток > 0 Тогда 
			СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ГотовКОтгрузке");
		//ИначеЕсли СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Продано Тогда
		//    СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Отгружен");
		КонецЕсли;		
	КонецЦикла;    
	
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Обновляем данные о производстве каждый раз, когда читаем документ из базы
	РассчитатьОстаткиКПроизводствуНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	КоличествоБольшеОстатка = 0;

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		 //Считает сумму строки табличной части
		 СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
		 //Получает цену покупки из регистра
		 СтрокаТабличнойЧасти.ЦенаПокупки = РаботаСоСправочниками.ЦенаМатериалов(РаботаСоСправочниками.ПолучитьТекущуюДатуСеанса(), СтрокаТабличнойЧасти.Номенклатура);
		 //Получает остаток из регистра
		 СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура); 
		 
		Если СтрокаТабличнойЧасти.Остаток < СтрокаТабличнойЧасти.Количество Тогда
			КоличествоБольшеОстатка = КоличествоБольшеОстатка + СтрокаТабличнойЧасти.Количество;
		КонецЕсли;  
		
	 КонецЦикла;

	 Если РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура) = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ПустаяСсылка") Тогда
		 СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Заявка");
	 КонецЕсли;  
	 
	 
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)            
	
	//Считает сумму строки табличной части
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		 //СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи; 
	 	 //Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
		 СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
 		 //Получает остаток из регистра
		 СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
	КонецЦикла; 
	 
	 Объект.Сумма = Объект.Товары.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	 Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл    
		//Из Общие модули Работа со справочниками Функции Продано получаем количество отгруженного по этому счёту
	 	СтрокаТабличнойЧасти.Продано = РаботаСоСправочниками.Продано(Объект.Ссылка, СтрокаТабличнойЧасти.Номенклатура);
		 //Получает остаток из регистра
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура);
	 КонецЦикла; 

КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;	
	
	Колво = Объект.Товары.Итог("Количество");
	Продано = Объект.Товары.Итог("Продано");
	Остаток = Объект.Товары.Итог("Остаток");  
	КоличествоБольшеОстатка = 0;
	
	//Автостатус "Счета в работе"
	Если Колво > 0 Тогда
		Если Колво > Продано Тогда 
			Если Остаток = 0 Тогда 
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.НеГотов");
			ИначеЕсли КоличествоБольшеОстатка > 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.ЧастичноГотов");
			ИначеЕсли КоличествоБольшеОстатка = 0 Тогда
				Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Готов");
			КонецЕсли;
		ИначеЕсли  Колво = Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Отгружен");  
		ИначеЕсли  Колво < Продано Тогда 
			Объект.Отгрузка = ПредопределенноеЗначение("Перечисление.СтатусыЗаказаКлиента.Перегруз");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает цену продажи товара при изменении суммы в табличной части.
//
// Параметры:
//   Элемент - Число - Элемент управления, вызвавший событие изменения.
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.ЦенаПродажи = 0;
	Иначе
		СтрокаТабличнойЧасти.ЦенаПродажи = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;

КонецПроцедуры


// Пересчитывает сумму строки табличной части "Товары" при изменении цены продажи.
//
// Параметры:
//   Элемент - Число - Элемент управления, вызвавший событие.
&НаКлиенте
Процедура ТоварыЦенаПродажиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьОстаткиКПроизводствуНаСервере()
    
    // Запрос для получения текущих долгов производства по этому Счету
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ЗаказыРезервыОстатки.Номенклатура КАК Номенклатура,
        |   ЗаказыРезервыОстатки.Цвет КАК Цвет,
        |   ЗаказыРезервыОстатки.RAL КАК RAL,
        |   ЗаказыРезервыОстатки.Фасовка КАК Фасовка,
        |   ЗаказыРезервыОстатки.КоличествоОстаток КАК ОстатокКПроизводству
        |ИЗ
        |   РегистрНакопления.ЗаказыРезервы.Остатки(
        |       ,
        |       Счет = &СчетНаОплату
        |   ) КАК ЗаказыРезервыОстатки";
        
    Запрос.УстановитьПараметр("СчетНаОплату", Объект.Ссылка);
    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
    
    // Заполняем виртуальную колонку в табличной части на форме
    Для Каждого СтрокаТЧ Из Объект.Товары Цикл
        
        // Ищем соответствующую строку в остатках (учитывая все характеристики)
        СтруктураПоиска = Новый Структура("Номенклатура, Цвет, RAL, Фасовка");
        ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
        
        НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
        
        Если НайденныеСтроки.Количество() > 0 Тогда
            СтрокаТЧ.ОсталосьПроизвести = НайденныеСтроки[0].ОстатокКПроизводству;
        Иначе
            // Если остатка в регистре нет, значит цех выпустил весь объем (или заказ еще не проведен)
            Если Объект.Проведен Тогда
                СтрокаТЧ.ОсталосьПроизвести = 0; 
            Иначе
                СтрокаТЧ.ОсталосьПроизвести = СтрокаТЧ.Количество;
            КонецЕсли;
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры
#КонецОбласти
